[
  "pomodoro-timer",
  "dataview",
  "obsidian-icon-folder",
  "templater-obsidian",
  "obsidian-minimal-settings",
  "obsidian-style-settings",
  "obsidian-hider",
  "calendar",
  "quickadd",
  "callout-manager",
  "emoji-shortcodes"
]