---
status: on
delivery: false
tags: ["IFCT79"]
type_note: question
parent:
topic: IFCT79
author: dzamo
description: "Alta disponibilidad en el backbone de los router"
title: "Alta disponibilidad en 'backbond inter router' - Asignaci√≥n fija/est√°tica IPv4 + topolog√≠a full-mesh/Open Shortest Path First (OSPF)"
---

# Ejercicio_2

## Enunciado

Sobre la siguiente topolog√≠a de red, implementar una configuraci√≥n de router de alta disponibilidad cumpliendo con los siguientes requisitos, estos son:

- Configuraci√≥n de IP sobre los activos (principalmente de tipo router), como asignaci√≥n fija o est√°tica.
- No utilzar ruteo RIP entre los router.
- Configuraci√≥n de alta disponibilidad, que sea capaz de mantener el servicio de ruteo en caso de falla de algunas de las conexiones del backbone principal.

## Representaci√≥n de la topolog√≠a

En la representaci√≥n [topolog√≠a Ejercicio 2][ejercicio-2] se muestra la topolog√≠a de interconexi√≥n l√≥gica del escenario.

![topolog√≠a Ejercicio 2][ejercicio_2]

[ejercicio_2]: ../images/ejercicio_2.png

## Resoluci√≥n

### Justificaci√≥n inicial

Para la resoluci√≥n de este escenario, y debido principalmente a que *no* debe utilizarse direccionamiento *RIP*, para la configuraci√≥n de asignaci√≥n de IP sobre los router se utilizar√°:

- ‚úÖ ***Asignaci√≥n IP est√°tica:*** Todos los **routers** tienen **IP**s **fijas** configuradas.
- ‚úÖ ***Sin RIP:*** Se utiliza ***Open Shortest Path First*** (***OSPF***) como protocolo de enrutamiento din√°mico.
- ‚úÖ ***Alta disponibilidad:*** Se configuro **Topolog√≠a full-mesh entre routers** que **garantiza redundancia**. Esta configuraci√≥n es implementada configurando **Open Shortest Path First** (**OSPF**). es un protocolo de enrutamiento que permite a los routers compartir autom√°ticamente informaci√≥n sobre las rutas disponibles en la red. Es como un sistema de mapas inteligente donde cada router conoce todos los caminos posibles para llegar a cualquier destino.

**Nota *uso de Packet Tracer* y/o *CLI IOS* para esta resoluci√≥n:** Para configurar la **OSPF**, y debido a que **Packet Tracer** no soporta completamente el configurar los activos de escenarios con esta caracteristica, es que se utiliza en la resoluci√≥n de este laboratorio el `CLI IOS` para configurar la *topolog√≠a full-mesh* cuando sea requerido en este documento. De todos modos, en este informe se adjunta tanto capturas de la interface gr√°fica de *"Cisco Packet Tracer"*  como los comandos emitidos para la configuraci√≥n de cada activo, seg√∫n corresponda.

### Configuraci√≥n IPv4 est√°tica

En este apartado se muestra la configuraci√≥n inicial que se le asigno a cada uno de los activos, principalmente los de tipo PC y a los Router. Se revisa as√≠ tanto el nombre, como la asignaci√≥n de IPv4 fija/est√°tica, para cumpliendo con uno de los requisitos iniciales.

<!--
#### PC0

![ipconfig pc0](../images/ejercicio_2-pc0.png)

#### PC1

![ipconfig pc1](../images/ejercicio_2-pc1.png)

#### PC2

![ipconfig pc2](../images/ejercicio_2-pc2.png)

#### PC3

![ipconfig pc3](../images/ejercicio_2-pc3.png)
-->
#### Revisi√≥n nombre host e `ipconfig` en las PC

En este item mediante capturas de la interface de *Cisco Packet Tracer* se muestra la asignaci√≥n de IPv4 establecidas sobre las PC del escenario.

|||
|:--:|:--:|
|![ipconfig pc0](../images/ejercicio_2-pc0.png)|![ipconfig pc1](../images/ejercicio_2-pc1.png)|
|PC0 - `ipconfig`|PC1 - `ipconfig`|

|||
|:--:|:--:|
|![ipconfig pc2](../images/ejercicio_2-pc2.png)|![ipconfig pc3](../images/ejercicio_2-pc3.png)|
|PC2 - `ipconfig`|PC3 - `ipconfig`|

#### Revisi√≥n nombre router y asignaci√≥n de IPv4

En este item mediante sesi√≥n de comandos *Cisco IOS* ejecutados sobre cada uno de los Router se muestra la asignaci√≥n de IPv4 sobre cada uno de las interface de cada uno de los router.

***[Router1]** (nombre activo y revisi√≥n configuraci√≥n IPv4)*

```c
Router1>enable
Router1#show running-config | section interface
interface GigabitEthernet0/0
 ip address 192.168.1.1 255.255.255.0
 duplex auto
 speed auto
interface GigabitEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
interface Serial0/0/0
 ip address 192.168.5.1 255.255.255.252
interface Serial0/0/1
 ip address 192.168.6.1 255.255.255.252
interface Serial0/1/0
 ip address 192.168.9.1 255.255.255.252
interface Serial0/1/1
 no ip address
 clock rate 2000000
interface Vlan1
 no ip address
 shutdown
```

***[Router2]***

```c
Router2>enable
Router2#show running-config | section interface
interface GigabitEthernet0/0
 ip address 192.168.4.1 255.255.255.0
 duplex auto
 speed auto
interface GigabitEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
interface Serial0/0/0
 ip address 192.168.6.2 255.255.255.252
 clock rate 2000000
interface Serial0/0/1
 ip address 192.168.7.1 255.255.255.252
interface Serial0/1/0
 ip address 192.168.10.1 255.255.255.252
interface Serial0/1/1
 no ip address
 clock rate 2000000
interface Vlan1
 no ip address
 shutdown
```

***[Router3]***

```c
Router3>enable
Router3#show running-config | section interface
interface GigabitEthernet0/0
 ip address 192.168.3.1 255.255.255.0
 duplex auto
 speed auto
interface GigabitEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
interface Serial0/0/0
 ip address 192.168.7.2 255.255.255.252
 clock rate 2000000
interface Serial0/0/1
 ip address 192.168.8.1 255.255.255.252
interface Serial0/1/0
 ip address 192.168.9.2 255.255.255.252
 clock rate 2000000
interface Serial0/1/1
 no ip address
 clock rate 2000000
 shutdown
interface Vlan1
 no ip address
 shutdown
```

***[Router4]***

```c
Router4>
Router4>ena
Router4#show running-config | section interface
interface GigabitEthernet0/0
 ip address 192.168.2.1 255.255.255.0
 duplex auto
 speed auto
interface GigabitEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
interface Serial0/0/0
 ip address 192.168.5.2 255.255.255.252
 clock rate 2000000
interface Serial0/0/1
 ip address 192.168.8.2 255.255.255.252
 clock rate 2000000
interface Serial0/1/0
 ip address 192.168.10.2 255.255.255.252
 clock rate 2000000
interface Serial0/1/1
 no ip address
 clock rate 2000000
 shutdown
interface Vlan1
 no ip address
 shutdown
```

#### Configuraci√≥n OFCT

***[Router4]** (Configuraci√≥n desde el CLI IOS)*

```c
Router4> enable
Router4# configure terminal

! Limpiar configuraci√≥n OSPF anterior
Router4(config)# no router ospf 1

! Nueva configuraci√≥n OSPF optimizada
Router4(config)# router ospf 1
Router4(config-router)# router-id 4.4.4.4

! Red LAN en √Årea 4 (sucursal)
Router4(config-router)# network 192.168.2.0 0.0.0.255 area 4

! Enlaces WAN en √Årea 0 (backbone) - TODAS las conexiones directas
Router4(config-router)# network 192.168.5.0 0.0.0.3 area 0
Router4(config-router)# network 192.168.8.0 0.0.0.3 area 0
Router4(config-router)# network 192.168.10.0 0.0.0.3 area 0

! Salir del modo router (omitimos timers)
Router4(config-router)# exit

! Configurar TODAS las interfaces seriales activas
Router4(config)# interface serial0/0/0
Router4(config-if)# ip ospf cost 100
Router4(config-if)# ip ospf hello-interval 5
Router4(config-if)# ip ospf dead-interval 20
Router4(config-if)# exit

Router4(config)# interface serial0/0/1
Router4(config-if)# ip ospf cost 100
Router4(config-if)# ip ospf hello-interval 5
Router4(config-if)# ip ospf dead-interval 20
Router4(config-if)# exit

Router4(config)# interface serial0/1/0
Router4(config-if)# ip ospf cost 100
Router4(config-if)# ip ospf hello-interval 5
Router4(config-if)# ip ospf dead-interval 20
Router4(config-if)# exit

Router4(config)# exit
Router4# write memory
```

Por fines mas did√°cticos y/o visuales, en esta [captura][router4-sesion-cli-ios-setting-ospf] se muestra la sesi√≥n de comandos CLI IOS ejecutados en Router4 para la configuraci√≥n de OSPF.

![Router4 configuraci√≥n OSPF][router4-sesion-cli-ios-setting-ospf]

[router4-sesion-cli-ios-setting-ospf]: ../images/ejercicio_2-router4-sesion-cli-ios-setting-ospf.png

#### üéâ Verificaci√≥n final

La configuraci√≥n en principio ha sido realizada, en este apartado se realiza una verificaci√≥n para ver la configuraci√≥n final de los respectivos router.

##### Primera verificaci√≥n

En este apartado con b√°sicamente el comando `show ip ospf neighbor` (correctamente ejecutado y sobre c/u de los router) aseguramos que cada router ve a su *vecino*. Siendo los resultados esperados tal que:

- Router1 deber√≠a ver: 3 vecinos (`2.2.2.2`, `3.3.3.3` y `4.4.4.4`)
- Router2 deber√≠a ver: 3 vecinos (`1.1.1.1`, `3.3.3.3` y `4.4.4.4`)
- Router3 deber√≠a ver: 3 vecinos (`1.1.1.1`, `2.2.2.2` y `4.4.4.4`)
- Router4 deber√≠a ver: 3 vecinos (`1.1.1.1`, `2.2.2.2` y `3.3.3.3`)

La ejecuci√≥n de este comando en cada uno de los router es mostrada en las capturas siguientes.

|||
|:--:|:--:|
|![Router1](../images/ejercicio_2-router1-check-conf.png)|![Router2](../images/ejercicio_2-router2-check-conf.png)|
|Router1 `show ip ospf neighbor`|Router2 `show ip ospf neighbor`|

|||
|:--:|:--:|
|![Router3](../images/ejercicio_2-router3-check-conf.png)|![Router4](../images/ejercicio_2-router4-check-conf.png)|
|Router3 `show ip ospf neighbor`|Router4 `show ip ospf neighbor`|

##### üìä Prueba R√°pida (Opcional)

En este apartado ejecutamos `show ip route ospf` (correctamente) para revisar de ver las rutas hacia las redes *vecinas* de cada uno de los router.

- *[Router1]*
  
  ```c
  Router1>ena
  Router1#show ip route ospf
  O IA 192.168.2.0 [110/101] via 192.168.5.2, 00:31:13, Serial0/0/0
  O IA 192.168.3.0 [110/165] via 192.168.5.2, 00:31:13, Serial0/0/0
  O IA 192.168.4.0 [110/101] via 192.168.6.2, 00:57:29, Serial0/0/1
       192.168.7.0/30 is subnetted, 1 subnets
  O       192.168.7.0 [110/200] via 192.168.6.2, 00:57:29, Serial0/0/1
       192.168.8.0/30 is subnetted, 1 subnets
  O       192.168.8.0 [110/164] via 192.168.5.2, 00:31:13, Serial0/0/0
       192.168.10.0/30 is subnetted, 1 subnets
  O       192.168.10.0 [110/164] via 192.168.5.2, 00:31:13, Serial0/0/0
  ```

- *[Router2]*
  
  ```c
  Router2>ena
  Router2#show ip route ospf
  O IA 192.168.1.0 [110/101] via 192.168.6.1, 00:59:00, Serial0/0/0
  O IA 192.168.2.0 [110/201] via 192.168.6.1, 00:32:39, Serial0/0/0
  O IA 192.168.3.0 [110/265] via 192.168.6.1, 00:32:39, Serial0/0/0
       192.168.5.0/30 is subnetted, 1 subnets
  O       192.168.5.0 [110/200] via 192.168.6.1, 00:59:00, Serial0/0/0
       192.168.8.0/30 is subnetted, 1 subnets
  O       192.168.8.0 [110/264] via 192.168.6.1, 00:32:39, Serial0/0/0
       192.168.9.0/30 is subnetted, 1 subnets
  O       192.168.9.0 [110/200] via 192.168.6.1, 00:59:00, Serial0/0/0
  ```

- *[Router3]*
  
  ```c
  Router3>ena
  Router3#show ip route ospf
  O IA 192.168.1.0 [110/165] via 192.168.8.2, 00:28:26, Serial0/0/1
  O IA 192.168.2.0 [110/65] via 192.168.8.2, 00:28:26, Serial0/0/1
  O IA 192.168.4.0 [110/265] via 192.168.8.2, 00:28:26, Serial0/0/1
       192.168.5.0/30 is subnetted, 1 subnets
  O       192.168.5.0 [110/164] via 192.168.8.2, 00:28:26, Serial0/0/1
       192.168.6.0/30 is subnetted, 1 subnets
  O       192.168.6.0 [110/264] via 192.168.8.2, 00:28:26, Serial0/0/1
       192.168.10.0/30 is subnetted, 1 subnets
  O       192.168.10.0 [110/128] via 192.168.8.2, 00:28:26, Serial0/0/1
  ```

- *[Router4]*
  
  ```c
  Router4>ena
  Router4#show ip route ospf
  O IA 192.168.1.0 [110/101] via 192.168.5.1, 00:36:56, Serial0/0/0
  O IA 192.168.3.0 [110/65] via 192.168.8.1, 00:03:06, Serial0/0/1
  O IA 192.168.4.0 [110/201] via 192.168.5.1, 00:36:56, Serial0/0/0
       192.168.6.0/30 is subnetted, 1 subnets
  O       192.168.6.0 [110/200] via 192.168.5.1, 00:36:56, Serial0/0/0
       192.168.7.0/30 is subnetted, 1 subnets
  O       192.168.7.0 [110/128] via 192.168.8.1, 00:36:56, Serial0/0/1
       192.168.9.0/30 is subnetted, 1 subnets
  O       192.168.9.0 [110/128] via 192.168.8.1, 00:36:56, Serial0/0/1
  ```

### üìä Resumen de la configuraci√≥n aplicada/escenario logrado

‚úÖ Red full-mesh con 4 routers y 6 enlaces WAN
 
‚úÖ Router-IDs √∫nicos (1.1.1.1 a 4.4.4.4)

‚úÖ Dise√±o por √°reas OSPF jer√°rquico (√Åreas 0-4)

‚úÖ Timers optimizados (detecci√≥n de fallas en 20 seg)

‚úÖ Convergencia r√°pida y redundancia total

‚úÖ Configuraci√≥n profesional nivel empresarial

### üéì Conceptos que se han utilizado/aprendido

- ***OSPF Multi-√°rea*** - Dise√±o jer√°rquico escalable
- ***Router-ID*** - Identificaci√≥n √∫nica de dispositivos
- ***Full-mesh*** - M√°xima redundancia posible
- ***Optimizaci√≥n de timers*** - Hello/Dead intervals
- ***Costos OSPF*** - Manipulaci√≥n de m√©tricas
- ***Wildcard masks*** - Configuraci√≥n precisa de redes
